module OpenProcurement
  module Constants
    TENDER_STATUS_OPTIONS = {
      'active'               => 'Активна',
      'active.enquiries'     => 'Період уточнень',
      'active.tendering'     => 'Прийом пропозицій',
      'active.auction'       => 'Період аукціону',
      'active.pre-qualification' => 'Пре-кваліфікація',
      'active.pre-qualification.stand-still' => 'Пре-кваліфікація: період оскарження',
      'active.qualification' => 'Кваліфікація',
      'active.awarded'       => 'Пропозиції розглянуто',
      'unsuccessful'         => 'Закупівля не відбулась',
      'complete'             => 'Завершено',
      'cancelled'            => 'Скасовано'
    }.freeze

    TENDER_DOCUMENT_TYPE_OPTIONS = {
      'notice' => 'Повідомлення про закупівлю',
      # Офіційне повідомлення, що містить деталі закупівлі. Це може бути посилання на документ, веб-сторінку, чи на офіційний бюлетень, де розміщено повідомлення.
      'biddingDocuments' => 'Документи закупівлі',
      # Інформація для потенційних постачальників, що описує цілі договору (наприклад, товари та послуги, які будуть закуплені) і процес торгів.
      'technicalSpecifications' => 'Технічні специфікації',
      # Детальна технічна інформація про товари або послуги, що повинні бути надані.
      'evaluationCriteria' => 'Критерії оцінки',
      # Інформація про те, як будуть оцінюватись пропозиції.
      'clarifications' => 'Пояснення до питань заданих учасниками',
      # Включає відповіді на питання, підняті на передтендерних конференціях.
      'eligibilityCriteria' => 'Критерії прийнятності',
      # Докладні документи про критерії відбору.
      'shortlistedFirms' => 'Фірми у короткому списку',
      'riskProvisions' => 'Положення для управління ризиками та зобов’язаннями',
      'billOfQuantity' => 'Кошторис',
      'bidders' => 'Інформація про учасників',
      # Інформація про учасників, їхні документи для перевірки та будь-які процесуальні пільги, на які вони можуть претендувати.
      'conflictOfInterest' => 'Виявлені конфлікти інтересів',
      'debarments' => 'Відмова у допуску до закупівлі',
      'contractProforma' => 'Проект договору'
    }
  end
end

